//! # Interception Copilot
//!
//! Rust port of the [Interception library](https://github.com/oblitum/Interception)
//! using `windows-sys` with a safe API for intercepting keyboard and mouse input on Windows.
//!
//! The Interception library allows you to intercept and modify keyboard and mouse input
//! at a low level on Windows systems. This Rust port provides safe wrappers for convenient use.
//!
//! ## Type-Safe Device API
//!
//! The library provides type-safe device structures that prevent misuse:
//!
//! ```rust,no_run
//! use interception_copilot::{KeyboardDevice, MouseDevice, FILTER_KEY_ALL, FILTER_MOUSE_ALL};
//!
//! // Create type-safe keyboard device  
//! let keyboard = KeyboardDevice::new(0).expect("Failed to create keyboard device");
//! keyboard.set_filter(FILTER_KEY_ALL).expect("Failed to set keyboard filter");
//!
//! // Create type-safe mouse device
//! let mouse = MouseDevice::new(0).expect("Failed to create mouse device");
//! mouse.set_filter(FILTER_MOUSE_ALL).expect("Failed to set mouse filter");
//!
//! // Type safety: you can only send keyboard strokes to keyboard devices
//! let key_strokes = vec![/* KeyStroke data */];
//! keyboard.send(&key_strokes).expect("Failed to send keyboard strokes");
//!
//! // Type safety: you can only send mouse strokes to mouse devices  
//! let mouse_strokes = vec![/* MouseStroke data */];
//! mouse.send(&mouse_strokes).expect("Failed to send mouse strokes");
//! ```

#![cfg(windows)]


/// Mouse button 3 down (alias for middle button)
pub const MOUSE_BUTTON_3_DOWN: MouseState = MOUSE_MIDDLE_BUTTON_DOWN;
/// Mouse button 3 up (alias for middle button)
pub const MOUSE_BUTTON_3_UP: MouseState = MOUSE_MIDDLE_BUTTON_UP;

/// Mouse movement flags
pub type MouseFlag = c_int;

/// Relative movement
pub const MOUSE_MOVE_RELATIVE: MouseFlag = 0x000;
/// Absolute movement
pub const MOUSE_MOVE_ABSOLUTE: MouseFlag = 0x001;
/// Virtual desktop coordinates
pub const MOUSE_VIRTUAL_DESKTOP: MouseFlag = 0x002;
/// Mouse attributes changed
pub const MOUSE_ATTRIBUTES_CHANGED: MouseFlag = 0x004;
/// Don't coalesce mouse movements
pub const MOUSE_MOVE_NOCOALESCE: MouseFlag = 0x008;
/// Terminal Services source shadow
pub const MOUSE_TERMSRV_SRC_SHADOW: MouseFlag = 0x100;

/// Filter bitmask for selecting which events to intercept
pub type Filter = c_ushort;

/// No filtering
pub const FILTER_NONE: Filter = 0x0000;
/// Filter all events
pub const FILTER_ALL: Filter = 0xFFFF;

// Keyboard filters
/// Filter key down events
pub const FILTER_KEY_DOWN: Filter = 0x01;
/// Filter key up events
pub const FILTER_KEY_UP: Filter = 0x02;
/// Filter E0 extended keys
pub const FILTER_KEY_E0: Filter = 0x08;
/// Filter E1 extended keys
pub const FILTER_KEY_E1: Filter = 0x016;

// Mouse button filters
/// Filter left mouse button down
pub const FILTER_MOUSE_LEFT_BUTTON_DOWN: Filter = 0x001;
/// Filter left mouse button up
pub const FILTER_MOUSE_LEFT_BUTTON_UP: Filter = 0x002;
/// Filter right mouse button down
pub const FILTER_MOUSE_RIGHT_BUTTON_DOWN: Filter = 0x004;
/// Filter right mouse button up
pub const FILTER_MOUSE_RIGHT_BUTTON_UP: Filter = 0x008;
/// Filter middle mouse button down
pub const FILTER_MOUSE_MIDDLE_BUTTON_DOWN: Filter = 0x010;
/// Filter middle mouse button up
pub const FILTER_MOUSE_MIDDLE_BUTTON_UP: Filter = 0x020;
/// Filter mouse button 4 down
pub const FILTER_MOUSE_BUTTON_4_DOWN: Filter = 0x040;
/// Filter mouse button 4 up
pub const FILTER_MOUSE_BUTTON_4_UP: Filter = 0x080;
/// Filter mouse button 5 down
pub const FILTER_MOUSE_BUTTON_5_DOWN: Filter = 0x100;
/// Filter mouse button 5 up
pub const FILTER_MOUSE_BUTTON_5_UP: Filter = 0x200;
/// Filter mouse wheel
pub const FILTER_MOUSE_WHEEL: Filter = 0x400;
/// Filter mouse horizontal wheel
pub const FILTER_MOUSE_HWHEEL: Filter = 0x800;
/// Filter mouse movement
pub const FILTER_MOUSE_MOVE: Filter = 0x1000;

/// No keyboard filtering
pub const FILTER_KEY_NONE: Filter = FILTER_NONE;
/// Filter all keyboard events
pub const FILTER_KEY_ALL: Filter = FILTER_ALL;
/// No mouse filtering
pub const FILTER_MOUSE_NONE: Filter = FILTER_NONE;
/// Filter all mouse events
pub const FILTER_MOUSE_ALL: Filter = FILTER_ALL;

/// A keyboard stroke event
#[derive(Debug, Clone, Copy)]
#[repr(C)]
pub struct KeyStroke {
    /// Virtual key code
    pub code: c_ushort,
    /// Key state flags
    pub state: c_ushort,
    /// Additional information
    pub information: c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KeyStroke"][size_of::<KeyStroke>() - 8usize];
    ["Alignment of KeyStroke"][align_of::<KeyStroke>() - 4usize];
    ["Offset of field: KeyStroke::code"][mem::offset_of!(KeyStroke, code) - 0usize];
    ["Offset of field: KeyStroke::state"][mem::offset_of!(KeyStroke, state) - 2usize];
    ["Offset of field: KeyStroke::information"][mem::offset_of!(KeyStroke, information) - 4usize];
};

/// A mouse stroke event  
#[derive(Debug, Clone, Copy)]
#[repr(C)]
pub struct MouseStroke {
    /// Mouse state flags
    pub state: c_ushort,
    /// Mouse movement flags
    pub flags: c_ushort,
    /// Mouse wheel delta
    pub rolling: c_short,
    /// X coordinate
    pub x: c_int,
    /// Y coordinate
    pub y: c_int,
    /// Additional information
    pub information: c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MouseStroke"][size_of::<MouseStroke>() - 20usize];
    ["Alignment of MouseStroke"][align_of::<MouseStroke>() - 4usize];
    ["Offset of field: MouseStroke::state"][mem::offset_of!(MouseStroke, state) - 0usize];
    ["Offset of field: MouseStroke::flags"][mem::offset_of!(MouseStroke, flags) - 2usize];
    ["Offset of field: MouseStroke::rolling"][mem::offset_of!(MouseStroke, rolling) - 4usize];
    ["Offset of field: MouseStroke::x"][mem::offset_of!(MouseStroke, x) - 8usize];
    ["Offset of field: MouseStroke::y"][mem::offset_of!(MouseStroke, y) - 12usize];
    ["Offset of field: MouseStroke::information"]
        [mem::offset_of!(MouseStroke, information) - 16usize];
};

/// Union type for input strokes (keyboard or mouse)
#[derive(Clone, Copy)]
#[repr(C)]
pub union Stroke {
    /// Keyboard stroke data
    pub key: KeyStroke,
    /// Mouse stroke data
    pub mouse: MouseStroke,
}

// Internal Windows API structures matching the C implementation

#[derive(Clone)]
#[repr(C)]
pub struct KeyboardInputData {
    pub unit_id: c_ushort,
    pub make_code: c_ushort,
    pub flags: c_ushort,
    pub reserved: c_ushort,
    pub extra_information: c_uint,
}

impl Default for KeyboardInputData {
    fn default() -> Self {
        unsafe { mem::zeroed() }
    }
}

#[derive(Clone)]
#[repr(C)]
pub struct MouseInputData {
    pub unit_id: c_ushort,
    pub flags: c_ushort,
    pub button_flags: c_ushort,
    pub button_data: c_ushort,
    pub raw_buttons: c_ulong,
    pub last_x: c_long,
    pub last_y: c_long,
    pub extra_information: c_ulong,
}

